papacy.org
#+TITLE: On the Papacy of Bertrand Russell
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="myStyle.css" />
#+OPTIONS: html-style:nil H:1 num:nil
#+HTML_LINK_HOME: index.html
/*Abstract.* I present several Pie formalizations of the claim:/

#+begin_quote
/1 = 0 implies I am the Pope./
#+end_quote

/Some formalizations capture Bertrand Russell's original argument with
high fidelity, and others are quite different (and in some regards
simpler). The goal is to highlight the implicit assumptions of the
various proofs, in particular with respect to explicit invocations of
the principle of explosion.  This piece is based on an email
conversation with [[https://people.cs.uchicago.edu/~stuart/][Stuart Kurtz]] and [[https://people.cs.uchicago.edu/~caldwellb/][Ben Caldwell]], who I consider to be
co-authors but without the responsibility of answering for my mistakes
or agreeing with my opinions./


Bertrand Russull is said to have proved that he was the Pope given
that 1 = 0 in order to demonstrate the [[https://en.wikipedia.org/wiki/Principle_of_explosion][principle of explosion]]
a.k.a. /ex falso quodlibet/.[fn::The exact source of this story seems
to be lost.  An [[https://www.reddit.com/r/math/comments/814cpi/bertrand_russell_is_the_pope/][old reddit post]] claims it's in the introduction to the
second edition of Russell's Principles of Mathematics, but unless I
have a false copy, this is not the case.]  This principle states that
any proposition follows from a contradiction.  The argument in it's
[[https://www.nku.edu/~longa/classes/mat385_resources/docs/russellpope.html][currently most cited form]] goes:

#+begin_quote
/Add 1 to both sides of the equation: then we have 2 = 1. The set
containing just me and the Pope has 2 members. But 2 = 1, so it has
only 1 member; therefore, I am the Pope./
#+end_quote

It's a clever argument, but is often presented aphoristically, leaving
just enough room for a chuckle, but not enough for rigorous analysis.
The purpose of this piece is to make some room.

Take, for example, this argument:

#+begin_quote
/1 = 0 contradicts the fact that 1 ≠ 0. By the principle of explosion, I
am the Pope./
#+end_quote

It clearly lacks the disarming wit of the Russell's argument and is
unlikely to persuade an individual who /doubts/ the principle in the
first place, but it does beg the question: what did Russell accomplish
with his argument over this one? He avoids referring to the principle
of explosion directly, but to what end? Is he making a claim about
[[https://en.wikipedia.org/wiki/Paraconsistent_logic][paraconsistent]] or [[https://en.wikipedia.org/wiki/Minimal_logic][minimal]] logic?  Is he attempting to demonstrate the
naturalness of the principle (perhaps by obfuscating its use)?[fn::It
goes without saying (but I'll say it anyway) that he's doing none of
these things, it's just a quip.]

In order to analyze this simple theorem to death, I'll consider
several formalizations of it in [[https://docs.racket-lang.org/pie/index.html][Pie]], a dependently typed programming
language created for the book [[https://thelittletyper.com][The Little Typer]] (which I recommend to
anyone interested in learning about dependent type theory).  The
motivation for this is threefold.

1. The Little Typer is used at UChicago by [[https://people.cs.uchicago.edu/~stuart/][Stuart Kurtz]] in his course
   on type theory, and I'd like this piece to be approachable to
   anyone who's taken the course (and is willing to do a bit of
   keyboard head-banging).
2. Pie is very explicit. This makes it easier (for me) to ensure I
   haven't done anything sneaky.[fn::Dependent pattern matching and
   implicit arguments are beautiful features, but using them sometimes
   feels like a riding finely-tuned motorcycle (not that I'd actually
   know, but I think the analogy stands). Pie is the steel frame bike
   you had in college, clunky and simple and gets the job done.]
3. I like it.

*Disclaimer:* This is /not/ a tutorial on dependent type theory or
Pie.  I realize this severely limits the scope of this piece, but also
I don't really care (sorry). That said, please read The Little Typer!
It's great!

* Absurdity

The principle of explosion appears in Pie as [[https://docs.racket-lang.org/pie/index.html#%28def._%28%28lib._pie%2Fmain..rkt%29._ind-.Absurd%29%29][~ind-Absurd~]], the
induction principle for [[https://docs.racket-lang.org/pie/index.html#%28part._.Absurd%29][~Absurd~]] (i.e., the empty type).  We can use
this to formalize the second, less witty argument above given a proof
that 1 is, in fact, not equal to 0.[fn:: A version of ~1<>0~ is given
in The Little Typer.]  In what follows, I use atoms to represent me
and the Pope.[fn::It's fair to question this choice. That said, using
atoms has some nice properties. For one, it allows me to avoid
postulating a ~Person~ type.  It would have also been possible to use
a different type as a proxy for ~Person~, e.g. ~Nat~, but ~Atom~ is
nice because it doesn't admit decidable equality, so using it makes
fewer philosophical assumptions about the nature of personhood.]  Also
note the standard encoding of negation as implication of absurdity.

#+begin_src lisp
  # lang pie

  (claim Not (-> U U))
  (define Not (lambda (A) (-> A Absurd)))

  (claim <> (Pi ((A U)) (-> A A U)))
  (define <> (lambda (A x y) (Not (= A x y))))

  (claim 1<>0 (<> Nat 1 0))
  (define 1<>0
    (lambda (1=0)
      (replace
        ; target
        1=0
        ; motive
        (lambda (n)
          (which-Nat
            ; target
            n
            ; base
            Absurd
            ; step
            (lambda (_) Trivial)))
        ; base
        sole)))

  (claim 1=0-implies-i-am-the-pope-0
    (-> (= Nat 1 0) (= Atom 'me 'pope)))
  (define 1=0-implies-i-am-the-pope-0
    (lambda (1=0)
      (ind-Absurd
        ; target
        (1<>0 1=0)
        ; motive
        (= Atom 'me 'pope))))
#+end_src

There's nothing wrong with this proof mathematically speaking; the
principle of explosion is an axiom in most standard logical
systems.[fn::That is, excluding paraconsistent and minimal systems.]
But it's not the proof that Russell gave.  He chooses to bring in some
pretty heavy artillery: sets.[fn::To call this heavy artillery is
somewhat anachronistic.  At the time, set theory was a fairly
lightweight mathematical foundations, and it would be several decades
before we feel comfortable leaving the "paradise" of set theory (to
quote Hilbert) and spend more time in the "playgrounds" of weaker
foundational systems (to quote Shore).  It's also a bit unfair: set
theory is only heavy if you're not already doing set theory, e.g., if
you're doing type theory.  But no matter, we forge ahead.]  We'll come
back to this. But before formalizing Russell's argument, an interlude
on what I believe is the simplest papacy proof that doesn't use
~ind-Absurd~.

