papacy.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-07-31 Thu 18:56 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>On the Papacy of Bertrand Russell</title>
<meta name="author" content="Nathan" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="myStyle.css" />
</head>
<body>
<div id="org-div-home-and-up"><a href="index.html">↩</a></div><div id="content" class="content">
<h1 class="title">On the Papacy of Bertrand Russell</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgbf74c02">Absurdity</a></li>
<li><a href="#org186805a">Congruence</a></li>
<li><a href="#orgb3478bb">Explosives</a></li>
<li><a href="#org4c3d3b2">Intermission</a></li>
<li><a href="#org65b9aaf">Vectors</a></li>
<li><a href="#org3f29cf5">Lists</a></li>
<li><a href="#org83f66c6">Finite Sets</a></li>
</ul>
</div>
</div>
<p>
<i><b>Abstract.</b> I present several Pie formalizations of the claim:</i>
</p>

<blockquote>
<p>
<i>1 = 0 implies I am the Pope.</i>
</p>
</blockquote>

<p>
<i>Some formalizations capture Bertrand Russell's original argument with
high fidelity, and others are quite different (and in some regards
simpler). The goal is to highlight the implicit assumptions of the
various proofs, in particular with respect to explicit invocations of
the principle of explosion.  This piece is based on an email
conversation with <a href="https://people.cs.uchicago.edu/~stuart/">Stuart Kurtz</a> and <a href="https://people.cs.uchicago.edu/~caldwellb/">Ben Caldwell</a>, who I consider to be
co-authors but without the responsibility of answering for my mistakes
or agreeing with my opinions.</i>
</p>


<p>
Bertrand Russull is said to have proved that he was the Pope given
that 1 = 0 in order to demonstrate the <a href="https://en.wikipedia.org/wiki/Principle_of_explosion">principle of explosion</a>
a.k.a. <i>ex falso quodlibet</i>.<sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup>  This principle states that
any proposition follows from a contradiction.  The argument in it's
<a href="https://www.nku.edu/~longa/classes/mat385_resources/docs/russellpope.html">currently most cited form</a> goes:
</p>

<blockquote>
<p>
<i>Add 1 to both sides of the equation: then we have 2 = 1. The set
containing just me and the Pope has 2 members. But 2 = 1, so it has
only 1 member; therefore, I am the Pope.</i>
</p>
</blockquote>

<p>
It's a clever argument, but is often presented aphoristically, leaving
just enough room for a chuckle, but not enough for rigorous analysis.
The purpose of this piece is to make some room.
</p>

<p>
Take, for example, this argument:
</p>

<blockquote>
<p>
<i>1 = 0 contradicts the fact that 1 ≠ 0. By the principle of explosion, I
am the Pope.</i>
</p>
</blockquote>

<p>
It clearly lacks the disarming wit of the Russell's argument and is
unlikely to persuade an individual who <i>doubts</i> the principle in the
first place, but it does beg the question: what did Russell accomplish
with his argument over this one? He avoids referring to the principle
of explosion directly, but to what end? Is he making a claim about
<a href="https://en.wikipedia.org/wiki/Paraconsistent_logic">paraconsistent</a> or <a href="https://en.wikipedia.org/wiki/Minimal_logic">minimal</a> logic?  Is he attempting to demonstrate the
naturalness of the principle (perhaps by obfuscating its use)?<sup><a id="fnr.2" class="footref" href="#fn.2" role="doc-backlink">2</a></sup>
</p>

<p>
In order to analyze this simple theorem to death, I'll consider
several formalizations of it in <a href="https://docs.racket-lang.org/pie/index.html">Pie</a>, a dependently typed programming
language created for the book <a href="https://thelittletyper.com">The Little Typer</a> (which I recommend to
anyone interested in learning about dependent type theory).  The
motivation for this is threefold.
</p>

<ol class="org-ol">
<li>The Little Typer is used at UChicago by <a href="https://people.cs.uchicago.edu/~stuart/">Stuart Kurtz</a> in his course
on type theory, and I'd like this piece to be approachable to
anyone who's taken the course (and is willing to do a bit of
keyboard head-banging).</li>
<li>Pie is very explicit. This makes it easier (for me) to ensure I
haven't done anything sneaky.<sup><a id="fnr.3" class="footref" href="#fn.3" role="doc-backlink">3</a></sup></li>
<li>I like it.</li>
</ol>

<p>
<b>Disclaimer:</b> This is <i>not</i> a tutorial on dependent type theory or
Pie.  I realize this severely limits the scope of this piece, but also
I don't really care (sorry). That said, please read The Little Typer!
It's great!
</p>
<div id="outline-container-orgbf74c02" class="outline-2">
<h2 id="orgbf74c02">Absurdity</h2>
<div class="outline-text-2" id="text-orgbf74c02">
<p>
The principle of explosion appears in Pie as <a href="https://docs.racket-lang.org/pie/index.html#%28def._%28%28lib._pie%2Fmain..rkt%29._ind-.Absurd%29%29"><code>ind-Absurd</code></a>, the
induction principle for <a href="https://docs.racket-lang.org/pie/index.html#%28part._.Absurd%29"><code>Absurd</code></a> (i.e., the empty type).  We can use
this to formalize the second, less witty argument above given a proof
that 1 is, in fact, not equal to 0.<sup><a id="fnr.4" class="footref" href="#fn.4" role="doc-backlink">4</a></sup>  In what follows, I use atoms to represent me
and the Pope.<sup><a id="fnr.5" class="footref" href="#fn.5" role="doc-backlink">5</a></sup>  Also
note the standard encoding of negation as implication of absurdity.
</p>

<div class="org-src-container">
<pre class="src src-lisp"># lang pie

(claim Not (-&gt; U U))
(define Not (<span style="color: #a020f0;">lambda</span> (A) (-&gt; A Absurd)))

(claim &lt;&gt; (Pi ((A U)) (-&gt; A A U)))
(define &lt;&gt; (<span style="color: #a020f0;">lambda</span> (A x y) (Not (= A x y))))

(claim 1&lt;&gt;0 (&lt;&gt; Nat 1 0))
(define 1&lt;&gt;0
  (<span style="color: #a020f0;">lambda</span> (1=0)
    (replace
      <span style="color: #b22222;">; target
</span>      1=0
      <span style="color: #b22222;">; motive
</span>      (<span style="color: #a020f0;">lambda</span> (n)
        (which-Nat
          <span style="color: #b22222;">; target
</span>          n
          <span style="color: #b22222;">; base
</span>          Absurd
          <span style="color: #b22222;">; step
</span>          (<span style="color: #a020f0;">lambda</span> (_) Trivial)))
      <span style="color: #b22222;">; base
</span>      sole)))

(claim 1=0-implies-i-am-the-pope-0
  (-&gt; (= Nat 1 0) (= Atom 'me 'pope)))
(define 1=0-implies-i-am-the-pope-0
  (<span style="color: #a020f0;">lambda</span> (1=0)
    (ind-Absurd
      <span style="color: #b22222;">; target
</span>      (1&lt;&gt;0 1=0)
      <span style="color: #b22222;">; motive
</span>      (= Atom 'me 'pope))))
</pre>
</div>

<p>
There's nothing wrong with this proof mathematically speaking; the
principle of explosion is an axiom in most standard logical
systems.<sup><a id="fnr.6" class="footref" href="#fn.6" role="doc-backlink">6</a></sup>
But it's not the proof that Russell gave.  He chooses to bring in some
pretty heavy artillery: sets.<sup><a id="fnr.7" class="footref" href="#fn.7" role="doc-backlink">7</a></sup>  We'll come
back to this. But before formalizing Russell's argument, an interlude
on what I believe is the simplest papacy proof that doesn't use
<code>ind-Absurd</code>.
</p>
</div>
</div>
