papacy.org
* Congruence

One crucial feature of natural numbers that they have a distinguished
element: 0. This number is more than just distinguished (it's the
smallest with respect to the standard ordering, it's an additive
identity and a multiplicative annihilator) but at the moment it's
distinguished status is all we need.  We can easily determine if any
number is or is not 0.  In Pie, this is witnessed by a simplified
recursor (already featured above) called [[https://docs.racket-lang.org/pie/index.html#%28def._%28%28lib._pie%2Fmain..rkt%29._which-.Nat%29%29][~which-Nat~]], with which we
can make values (and types!) that depend on whether or not a given
number is 0.

Consider this simple (though still less clever) papacy proof:

#+begin_quote
/Suppose we give the Pope a sticker with the number 0 on it, and give
all other persons a sticker with the number 1 on it.  It follows that
if a person has a 0 sticker, then they are the Pope.  Since 1 = 0, I
have a 0 sticker, so I am the Pope./
#+end_quote

In fact, everyone is the pope (that's kind of the point).  This
argument can be formalized in Pie with [[https://docs.racket-lang.org/pie/index.html#%28def._%28%28lib._pie%2Fmain..rkt%29._cong%29%29][~cong~]], which allows us to
prove f(x) = f(y) given x = y.

#+begin_src lisp
  (claim 1=0-implies-i-am-the-pope-1
    (-> (= Nat 1 0) (= Atom 'me 'pope)))
  (define 1=0-implies-i-am-the-pope-1
    (lambda (1=0)
      (cong
        ; target
        1=0
        ; fun
        (the (-> Nat Atom)
          (lambda (n)
            (which-Nat
              ; target
              n
              ; base
              'pope
              ; step
              (lambda (_) 'me)))))))
#+end_src

And no use of ~ind-Absurd~, so the principle of explosion isn't
necessary to prove Russell's papacy.  But this proof might have you
thinking: if all we're doing is applying a function to each side of
the equation 1 = 0 (in essence replacing 1 with me and 0 with the
Pope) what's to stop us from making /any/ two things equal? Answer:
nothing!

#+begin_src lisp
  (claim 1=0-implies-any-equality
    (Pi ((A U)
         (x A)
         (y A))
      (-> (= Nat 1 0) (= A x y))))
  (define 1=0-implies-any-equality
    (lambda (A x y 1=0)
      (cong
        ; target
        1=0
        ; fun
        (the (-> Nat A)
          (lambda (n)
            (which-Nat
              ; target
              n
              ; base
              y
              ; step
              (lambda (_) x)))))))

  (claim 1=0-implies-i-am-the-pope-2
    (-> (= Nat 1 0) (= Atom 'me 'pope)))
  (define 1=0-implies-i-am-the-pope-2
    (lambda (1=0)
      (1=0-implies-any-equality Atom 'me 'pope 1=0)))
#+end_src

But wait, there's more! With a little more finesse we can derive
/anything/ from 1 = 0. Rather than using congruence, we can use
[[https://docs.racket-lang.org/pie/index.html#%28def._%28%28lib._pie%2Fmain..rkt%29._replace%29%29][~replace~]], which for any predicate[fn::Note that Pie uses the term
/motive/ for a predicate used in an induction principle.]  P and
equality x = y, allows us to /prove/ P(x) and /conclude/ P(y).
Because 0 is a distinguished number, we can design a predicate P such
that P(1) easy to prove (e.g., [[https://docs.racket-lang.org/pie/index.html#%28part._.Trivial%29][~Trivial~]]) and P(0) is anything we
want.

#+begin_src lisp
  (claim explode-1=0
    (Pi ((A U)) (-> (= Nat 1 0) A)))
  (define explode-1=0
    (lambda (A 1=0)
      (replace
        ; target
        1=0
        ; motive
        (lambda (a)
          (which-Nat
            ; target
            a
            ; base
            A
            ; step
            (lambda (_) Trivial)))
        ; base
        sole)))

  (claim 1=0-implies-i-am-the-pope-3
    (-> (= Nat 1 0) (= Atom 'me 'pope)))
  (define 1=0-implies-i-am-the-pope-3
    (explode-1=0 (= Atom 'me 'pope)))
#+end_src

In other words, the claim 1 = 0 is /explosive/.  In fact, we could
/define/ ~Absurd~ using the type ~(= Nat 0 1)~, i.e., we could do away
with ~Absurd~ altogether and used ~(= Nat 0 1)~ instead.[fn::This is a
standard fact of constructive mathematics.  See, e.g., Proposition 3.2
of Constructivism in Mathematics by Troelstra and van Dalen.  I most
recently came across this argument in a [[https://github.com/lawrencecpaulson/lawrencecpaulson.github.io/issues/43#issuecomment-1944264835][comment]] by [[https://hermesmarc.github.io][Marc Hermes]] on a
[[https://lawrencecpaulson.github.io/2024/02/14/Contradiction.html][blog post]] by [[https://www.cl.cam.ac.uk/~lp15/][Lawrence C. Paulson]] on the same topic as this one.]

