papacy.html
<div id="outline-container-org186805a" class="outline-2">
<h2 id="org186805a">Congruence</h2>
<div class="outline-text-2" id="text-org186805a">
<p>
One crucial feature of natural numbers that they have a distinguished
element: 0. This number is more than just distinguished (it's the
smallest with respect to the standard ordering, it's an additive
identity and a multiplicative annihilator) but at the moment it's
distinguished status is all we need.  We can easily determine if any
number is or is not 0.  In Pie, this is witnessed by a simplified
recursor (already featured above) called <a href="https://docs.racket-lang.org/pie/index.html#%28def._%28%28lib._pie%2Fmain..rkt%29._which-.Nat%29%29"><code>which-Nat</code></a>, with which we
can make values (and types!) that depend on whether or not a given
number is 0.
</p>

<p>
Consider this simple (though still less clever) papacy proof:
</p>

<blockquote>
<p>
<i>Suppose we give the Pope a sticker with the number 0 on it, and give
all other persons a sticker with the number 1 on it.  It follows that
if a person has a 0 sticker, then they are the Pope.  Since 1 = 0, I
have a 0 sticker, so I am the Pope.</i>
</p>
</blockquote>

<p>
In fact, everyone is the pope (that's kind of the point).  This
argument can be formalized in Pie with <a href="https://docs.racket-lang.org/pie/index.html#%28def._%28%28lib._pie%2Fmain..rkt%29._cong%29%29"><code>cong</code></a>, which allows us to
prove f(x) = f(y) given x = y.
</p>

<div class="org-src-container">
<pre class="src src-lisp">(claim 1=0-implies-i-am-the-pope-1
  (-&gt; (= Nat 1 0) (= Atom 'me 'pope)))
(define 1=0-implies-i-am-the-pope-1
  (<span style="color: #a020f0;">lambda</span> (1=0)
    (cong
      <span style="color: #b22222;">; target
</span>      1=0
      <span style="color: #b22222;">; fun
</span>      (<span style="color: #a020f0;">the</span> (-&gt; Nat Atom)
        (<span style="color: #a020f0;">lambda</span> (n)
          (which-Nat
            <span style="color: #b22222;">; target
</span>            n
            <span style="color: #b22222;">; base
</span>            'pope
            <span style="color: #b22222;">; step
</span>            (<span style="color: #a020f0;">lambda</span> (_) 'me)))))))
</pre>
</div>

<p>
And no use of <code>ind-Absurd</code>, so the principle of explosion isn't
necessary to prove Russell's papacy.  But this proof might have you
thinking: if all we're doing is applying a function to each side of
the equation 1 = 0 (in essence replacing 1 with me and 0 with the
Pope) what's to stop us from making <i>any</i> two things equal? Answer:
nothing!
</p>

<div class="org-src-container">
<pre class="src src-lisp">(claim 1=0-implies-any-equality
  (Pi ((A U)
       (x A)
       (y A))
    (-&gt; (= Nat 1 0) (= A x y))))
(define 1=0-implies-any-equality
  (<span style="color: #a020f0;">lambda</span> (A x y 1=0)
    (cong
      <span style="color: #b22222;">; target
</span>      1=0
      <span style="color: #b22222;">; fun
</span>      (<span style="color: #a020f0;">the</span> (-&gt; Nat A)
        (<span style="color: #a020f0;">lambda</span> (n)
          (which-Nat
            <span style="color: #b22222;">; target
</span>            n
            <span style="color: #b22222;">; base
</span>            y
            <span style="color: #b22222;">; step
</span>            (<span style="color: #a020f0;">lambda</span> (_) x)))))))

(claim 1=0-implies-i-am-the-pope-2
  (-&gt; (= Nat 1 0) (= Atom 'me 'pope)))
(define 1=0-implies-i-am-the-pope-2
  (<span style="color: #a020f0;">lambda</span> (1=0)
    (1=0-implies-any-equality Atom 'me 'pope 1=0)))
</pre>
</div>

<p>
But wait, there's more! With a little more finesse we can derive
<i>anything</i> from 1 = 0. Rather than using congruence, we can use
<a href="https://docs.racket-lang.org/pie/index.html#%28def._%28%28lib._pie%2Fmain..rkt%29._replace%29%29"><code>replace</code></a>, which for any predicate<sup><a id="fnr.8" class="footref" href="#fn.8" role="doc-backlink">8</a></sup>  P and
equality x = y, allows us to <i>prove</i> P(x) and <i>conclude</i> P(y).
Because 0 is a distinguished number, we can design a predicate P such
that P(1) easy to prove (e.g., <a href="https://docs.racket-lang.org/pie/index.html#%28part._.Trivial%29"><code>Trivial</code></a>) and P(0) is anything we
want.
</p>

<div class="org-src-container">
<pre class="src src-lisp">(claim explode-1=0
  (Pi ((A U)) (-&gt; (= Nat 1 0) A)))
(define explode-1=0
  (<span style="color: #a020f0;">lambda</span> (A 1=0)
    (replace
      <span style="color: #b22222;">; target
</span>      1=0
      <span style="color: #b22222;">; motive
</span>      (<span style="color: #a020f0;">lambda</span> (a)
        (which-Nat
          <span style="color: #b22222;">; target
</span>          a
          <span style="color: #b22222;">; base
</span>          A
          <span style="color: #b22222;">; step
</span>          (<span style="color: #a020f0;">lambda</span> (_) Trivial)))
      <span style="color: #b22222;">; base
</span>      sole)))

(claim 1=0-implies-i-am-the-pope-3
  (-&gt; (= Nat 1 0) (= Atom 'me 'pope)))
(define 1=0-implies-i-am-the-pope-3
  (explode-1=0 (= Atom 'me 'pope)))
</pre>
</div>

<p>
In other words, the claim 1 = 0 is <i>explosive</i>.  In fact, we could
<i>define</i> <code>Absurd</code> using the type <code>(= Nat 0 1)</code>, i.e., we could do away
with <code>Absurd</code> altogether and used <code>(= Nat 0 1)</code> instead.<sup><a id="fnr.9" class="footref" href="#fn.9" role="doc-backlink">9</a></sup>
</p>
</div>
</div>
