papacy.org
* Explosives

The first thing to observe is just how lucky Russell was in the choice
of contradiction from which he needed to prove his papacy. It just so
happens that 1 = 0 is explosive in the sense above.  This gave him a
fair amount power to come up with a proof.  We can even re-imagine
Russell's argument as a sort of magic trick:

#+begin_quote
/Here I have here an ordinary sheet of paper. On one side I've written
the number 1, and on the other the number 0.  May I have a volunteer
write a proposition on the side with 0?/

/Ah, "Bertrand Russell is the Pope", very good./

/I will now, before your very eyes, prove to you that I am the Pope
assuming that 1 = 0.  I begin by writing on my sheet of paper, the
side with the number 1: "My name is Bertrand Russell."  We all accept
this to be true, yes?  Then it is certainly the case that the side
with 1 has written on it a true fact, yes? Very good. Now, suppose 1
= 0.  Then you must confess that the side with 0 has written on it a
true fact! For, 1 or 0, what difference does it make if they are
equal? But that true fact is ... Presto! I am the Pope!/

#+end_quote

In the presence of the principle of explosion, everything provably
false is explosive, and this can be witnessed within Pie (without
using ~ind-Absurd~).  In fact, that everything provably false is
explosive is /equivalent/ to the principle of explosion.

#+begin_src lisp
  (claim ind-absurd-implies-explode
    (-> (Pi ((A U)) (-> Absurd A))
      (Pi ((A U)) (-> (Not A) (Pi ((B U)) (-> A B))))))
  (define ind-absurd-implies-explode
    (lambda (ind-absurd A not-a B a)
      (ind-absurd B (not-a a))))

  (claim explode-implies-ind-absurd
    (-> (Pi ((A U)) (-> (Not A) (Pi ((B U)) (-> A B))))
      (Pi ((A U)) (-> Absurd A))))
  (define explode-implies-ind-absurd
    (lambda (explode A)
      (explode Absurd (lambda (x) x) A)))
#+end_src



But what we're saying about 1 = 0 is stronger than this: let's say
that a type ~A~ is *truly explosive* if we can derive anything from
~A~ without ~ind-Absurd~.  Any equality between unequal natural
numbers is truly explosive. So is ~(Pi ((A U)) A)~ (which expresses
that everything is true).

There are also many claims which are provably false and not truly
explosive, e.g., ~Pair Absurd Absurd~ and ~Either Absurd (= Nat 13
5)~.  Also, just ~Absurd~.  Imagine if Russell's interlocutor in the
original story had said:

#+begin_quote
  /You're telling me that anything follows from a contradiction? Well
  then, prove that you're the Pope from the false proposition!/
#+end_quote

I'm sure Russull would come up with a more intelligent response than I
could, but he couldn't succeed in proving his papacy without appealing
to the principle of explosion.[fn::There's much more to say about
this. For example, it's outside the scope of this piece to prove that
the principle of explosion isn't a theorem in Pie without
~ind-Absurd~. There are also some interesting semi-classical
principles that arise from looking more carefully at the notion of
explosion.  I may come back to these questions in another piece.]

* Intermission

Let's take stock.  What was Russell supposed to accomplish with his
argument? I've presented things up to now as though our imagined
interlocutor /doubted/ the principle of explosion.  We've shown that
we can use a form of explosion to prove Russell's papacy without
appealing to the principle proper.

But perhaps our imagined interlocutor was just challenging the
naturalness of the principle. Maybe they didn't doubt the principle
/per se/ but wanted a demonstration of its use in "normal" discourse.
In this sense, the use of ~explode-1=0~ is also likely to be not all
too satisfying; it has the feeling of a magic trick.  And the
congruence proof has an equality-twiddling flavor which is
mathematically acceptable, but not necessarily intuitive.

In what remains, we look at a few formalization which are closer to
Russell's argument, and hence more natural. I believe the first one
(using vectors) is the "correct" one, but it depends on a loose
interpretation of Russell's meaning of "set."

