papacy.html
<div id="outline-container-orgb3478bb" class="outline-2">
<h2 id="orgb3478bb">Explosives</h2>
<div class="outline-text-2" id="text-orgb3478bb">
<p>
The first thing to observe is just how lucky Russell was in the choice
of contradiction from which he needed to prove his papacy. It just so
happens that 1 = 0 is explosive in the sense above.  This gave him a
fair amount power to come up with a proof.  We can even re-imagine
Russell's argument as a sort of magic trick:
</p>

<blockquote>
<p>
<i>Here I have here an ordinary sheet of paper. On one side I've written
the number 1, and on the other the number 0.  May I have a volunteer
write a proposition on the side with 0?</i>
</p>

<p>
<i>Ah, "Bertrand Russell is the Pope", very good.</i>
</p>

<p>
<i>I will now, before your very eyes, prove to you that I am the Pope
assuming that 1 = 0.  I begin by writing on my sheet of paper, the
side with the number 1: "My name is Bertrand Russell."  We all accept
this to be true, yes?  Then it is certainly the case that the side
with 1 has written on it a true fact, yes? Very good. Now, suppose 1
= 0.  Then you must confess that the side with 0 has written on it a
true fact! For, 1 or 0, what difference does it make if they are
equal? But that true fact is &#x2026; Presto! I am the Pope!</i>
</p>
</blockquote>

<p>
In the presence of the principle of explosion, everything provably
false is explosive, and this can be witnessed within Pie (without
using <code>ind-Absurd</code>).  In fact, that everything provably false is
explosive is <i>equivalent</i> to the principle of explosion.
</p>

<div class="org-src-container">
<pre class="src src-lisp">(claim ind-absurd-implies-explode
  (-&gt; (Pi ((A U)) (-&gt; Absurd A))
    (Pi ((A U)) (-&gt; (Not A) (Pi ((B U)) (-&gt; A B))))))
(define ind-absurd-implies-explode
  (<span style="color: #a020f0;">lambda</span> (ind-absurd A not-a B a)
    (ind-absurd B (not-a a))))

(claim explode-implies-ind-absurd
  (-&gt; (Pi ((A U)) (-&gt; (Not A) (Pi ((B U)) (-&gt; A B))))
    (Pi ((A U)) (-&gt; Absurd A))))
(define explode-implies-ind-absurd
  (<span style="color: #a020f0;">lambda</span> (explode A)
    (explode Absurd (<span style="color: #a020f0;">lambda</span> (x) x) A)))
</pre>
</div>



<p>
But what we're saying about 1 = 0 is stronger than this: let's say
that a type <code>A</code> is <b>truly explosive</b> if we can derive anything from
<code>A</code> without <code>ind-Absurd</code>.  Any equality between unequal natural
numbers is truly explosive. So is <code>(Pi ((A U)) A)</code> (which expresses
that everything is true).
</p>

<p>
There are also many claims which are provably false and not truly
explosive, e.g., <code>Pair Absurd Absurd</code> and <code>Either Absurd (= Nat 13
5)</code>.  Also, just <code>Absurd</code>.  Imagine if Russell's interlocutor in the
original story had said:
</p>

<blockquote>
<p>
<i>You're telling me that anything follows from a contradiction? Well
then, prove that you're the Pope from the false proposition!</i>
</p>
</blockquote>

<p>
I'm sure Russull would come up with a more intelligent response than I
could, but he couldn't succeed in proving his papacy without appealing
to the principle of explosion.<sup><a id="fnr.10" class="footref" href="#fn.10" role="doc-backlink">10</a></sup>
</p>
</div>
</div>
<div id="outline-container-org4c3d3b2" class="outline-2">
<h2 id="org4c3d3b2">Intermission</h2>
<div class="outline-text-2" id="text-org4c3d3b2">
<p>
Let's take stock.  What was Russell supposed to accomplish with his
argument? I've presented things up to now as though our imagined
interlocutor <i>doubted</i> the principle of explosion.  We've shown that
we can use a form of explosion to prove Russell's papacy without
appealing to the principle proper.
</p>

<p>
But perhaps our imagined interlocutor was just challenging the
naturalness of the principle. Maybe they didn't doubt the principle
<i>per se</i> but wanted a demonstration of its use in "normal" discourse.
In this sense, the use of <code>explode-1=0</code> is also likely to be not all
too satisfying; it has the feeling of a magic trick.  And the
congruence proof has an equality-twiddling flavor which is
mathematically acceptable, but not necessarily intuitive.
</p>

<p>
In what remains, we look at a few formalization which are closer to
Russell's argument, and hence more natural. I believe the first one
(using vectors) is the "correct" one, but it depends on a loose
interpretation of Russell's meaning of "set."
</p>
</div>
</div>
