papacy.org
* Vectors

We begin by putting me and the Pope into a 2-element vector:

#+begin_src lisp
  (claim me-and-the-pope-Vec (Vec Atom 2))
  (define me-and-the-pope-Vec (vec:: 'me (vec:: 'pope vecnil)))
#+end_src

We'd like to argue that if we extract 2 elements from a 1-element
vector then they're the same element.  But in order to identify me and
the Pope, it must be that if we extract 2 elements in the same way
from a 2-element vector, then they're different.

We already have one way of extracting an element from a vector: [[https://docs.racket-lang.org/pie/index.html#%28def._%28%28lib._pie%2Fmain..rkt%29._head%29%29][~head~]]
grabs the first one.  We need another way of extracting an element
which gives the head element of a singleton, and a non-head element of
a 2-element vector. So we define a ~next~ function, which grabs the
/second/ element of a vector, if it exists, and otherwise, falls back
to the head.  This will be more convenient if we pre-destruct the
given vector; in other words, we're really defining a head function
with a default value for the empty case.

#+begin_src lisp
  (claim next
    (Pi ((A U)
         (n Nat))
      (-> A (Vec A n) A)))
  (define next
    (lambda (A n a v)
      (ind-Vec
        ; target-1
        n
        ; target-2
        v
        ; motive
        (lambda (_ _) A)
        ; base
        a
        ; step
        (lambda (_ a _ _) a))))
#+end_src

We then show that if the tail of our vector is empty (i.e., the vector is
a singleton), then the head element is the same as the next element.
We express the emptiness of the tail in terms of its length because
this will make using the hypothesis 1 = 0 easier.

#+begin_src lisp
  (claim empty-tail-implies-head=next
    (Pi ((A U)
         (n Nat)
         (n=0 (= Nat n 0))
         (v (Vec A (add1 n))))
      (= A
         (head v)
         (next A n (head v) (tail v)))))
  (define empty-tail-implies-head=next
    (lambda (A n n=0)
      (replace
        ; target
        (symm n=0)
        ; motive
        (lambda (k)
          (Pi ((v (Vec A (add1 k))))
            (= A (head v) (next A k (head v) (tail v)))))
        ; base
        (lambda (v)
          (replace
            ; target
            (the (= (Vec A 0) vecnil (tail v)) (same vecnil))
            ; motive
            (lambda (a) (= A (head v) (next A 0 (head v) a)))
            ; base
            (same (head v)))))))
#+end_src

And so if 1 = 0, ~me-and-the-pope~ is a 1-element vector, and the
head element (~'me~) is the same as the next element (~'pope~).

#+begin_src lisp
   (claim 1=0-implies-i-am-the-pope-4
     (-> (= Nat 1 0) (= Atom 'me 'pope)))
   (define 1=0-implies-i-am-the-pope-4
     (lambda (1=0)
       (empty-tail-implies-head=next
         Atom
         1
         1=0
         me-and-the-pope-Vec)))
#+end_src

Presto! (just kidding) I believe this proof captures the spirit of
Russell's argument while remaining simple.  And it doesn't appeal to
the principle of explosion, just our ability to fool our type system
into thinking that a 2-element vector only has 1 element.  It's only
real knock is that it doesn't use to any set-theoretic language (and
this isn't a true knock in my opinion).  Also, and this super
nitpicky, it doesn't use the "add 1 to both sides" part of the
argument.

But we're not here to stop at a reasonable stopping point, we're here
to overdo things. So let's suppose we /do/ want to use set-theoretic
language (and add 1 to both sides).  The first thing we'll have to
figure out is how to talk about /membership/. It's not possible to
define a membership predicate for vectors directly because of the
(somewhat surprising) absence of a ~rec-Vec~ recursor.[fn::This isn't
a limitation of dependent type theory in general, just a limitation of
Pie: it doesn't have a universe hierarchy.  Without a recursor (as
opposed to an inductor) we'd get the dreaded "U is a type, but it does
not have a type" error when defining the motive ~(lambda (_ _) U)~.]
But there is [[https://docs.racket-lang.org/pie/index.html#%28def._%28%28lib._pie%2Fmain..rkt%29._rec-.List%29%29][~rec-List~]]!

