papacy.html
<div id="outline-container-org65b9aaf" class="outline-2">
<h2 id="org65b9aaf">Vectors</h2>
<div class="outline-text-2" id="text-org65b9aaf">
<p>
We begin by putting me and the Pope into a 2-element vector:
</p>

<div class="org-src-container">
<pre class="src src-lisp">(claim me-and-the-pope-Vec (Vec Atom 2))
(define me-and-the-pope-Vec (vec:: 'me (vec:: 'pope vecnil)))
</pre>
</div>

<p>
We'd like to argue that if we extract 2 elements from a 1-element
vector then they're the same element.  But in order to identify me and
the Pope, it must be that if we extract 2 elements in the same way
from a 2-element vector, then they're different.
</p>

<p>
We already have one way of extracting an element from a vector: <a href="https://docs.racket-lang.org/pie/index.html#%28def._%28%28lib._pie%2Fmain..rkt%29._head%29%29"><code>head</code></a>
grabs the first one.  We need another way of extracting an element
which gives the head element of a singleton, and a non-head element of
a 2-element vector. So we define a <code>next</code> function, which grabs the
<i>second</i> element of a vector, if it exists, and otherwise, falls back
to the head.  This will be more convenient if we pre-destruct the
given vector; in other words, we're really defining a head function
with a default value for the empty case.
</p>

<div class="org-src-container">
<pre class="src src-lisp">(claim next
  (Pi ((A U)
       (n Nat))
    (-&gt; A (Vec A n) A)))
(define next
  (<span style="color: #a020f0;">lambda</span> (A n a v)
    (ind-Vec
      <span style="color: #b22222;">; target-1
</span>      n
      <span style="color: #b22222;">; target-2
</span>      v
      <span style="color: #b22222;">; motive
</span>      (<span style="color: #a020f0;">lambda</span> (_ _) A)
      <span style="color: #b22222;">; base
</span>      a
      <span style="color: #b22222;">; step
</span>      (<span style="color: #a020f0;">lambda</span> (_ a _ _) a))))
</pre>
</div>

<p>
We then show that if the tail of our vector is empty (i.e., the vector is
a singleton), then the head element is the same as the next element.
We express the emptiness of the tail in terms of its length because
this will make using the hypothesis 1 = 0 easier.
</p>

<div class="org-src-container">
<pre class="src src-lisp">(claim empty-tail-implies-head=next
  (Pi ((A U)
       (n Nat)
       (n=0 (= Nat n 0))
       (v (Vec A (add1 n))))
    (= A
       (head v)
       (next A n (head v) (tail v)))))
(define empty-tail-implies-head=next
  (<span style="color: #a020f0;">lambda</span> (A n n=0)
    (replace
      <span style="color: #b22222;">; target
</span>      (symm n=0)
      <span style="color: #b22222;">; motive
</span>      (<span style="color: #a020f0;">lambda</span> (k)
        (Pi ((v (Vec A (add1 k))))
          (= A (head v) (next A k (head v) (tail v)))))
      <span style="color: #b22222;">; base
</span>      (<span style="color: #a020f0;">lambda</span> (v)
        (replace
          <span style="color: #b22222;">; target
</span>          (<span style="color: #a020f0;">the</span> (= (Vec A 0) vecnil (tail v)) (same vecnil))
          <span style="color: #b22222;">; motive
</span>          (<span style="color: #a020f0;">lambda</span> (a) (= A (head v) (next A 0 (head v) a)))
          <span style="color: #b22222;">; base
</span>          (same (head v)))))))
</pre>
</div>

<p>
And so if 1 = 0, <code>me-and-the-pope</code> is a 1-element vector, and the
head element (<code>'me</code>) is the same as the next element (<code>'pope</code>).
</p>

<div class="org-src-container">
<pre class="src src-lisp">(claim 1=0-implies-i-am-the-pope-4
  (-&gt; (= Nat 1 0) (= Atom 'me 'pope)))
(define 1=0-implies-i-am-the-pope-4
  (<span style="color: #a020f0;">lambda</span> (1=0)
    (empty-tail-implies-head=next
      Atom
      1
      1=0
      me-and-the-pope-Vec)))
</pre>
</div>

<p>
Presto! (just kidding) I believe this proof captures the spirit of
Russell's argument while remaining simple.  And it doesn't appeal to
the principle of explosion, just our ability to fool our type system
into thinking that a 2-element vector only has 1 element.  It's only
real knock is that it doesn't use to any set-theoretic language (and
this isn't a true knock in my opinion).  Also, and this super
nitpicky, it doesn't use the "add 1 to both sides" part of the
argument.
</p>

<p>
But we're not here to stop at a reasonable stopping point, we're here
to overdo things. So let's suppose we <i>do</i> want to use set-theoretic
language (and add 1 to both sides).  The first thing we'll have to
figure out is how to talk about <i>membership</i>. It's not possible to
define a membership predicate for vectors directly because of the
(somewhat surprising) absence of a <code>rec-Vec</code> recursor.<sup><a id="fnr.11" class="footref" href="#fn.11" role="doc-backlink">11</a></sup>
But there is <a href="https://docs.racket-lang.org/pie/index.html#%28def._%28%28lib._pie%2Fmain..rkt%29._rec-.List%29%29"><code>rec-List</code></a>!
</p>
</div>
</div>
