papacy.org
* Lists

Round 2: we begin by putting me and the pope into a 2-element /list/:

#+begin_src lisp
  (claim me-and-the-pope-List (List Atom))
  (define me-and-the-pope-List (:: 'me (:: 'pope nil)))
#+end_src

Lists don't keep track of their own length, so we'll need to define a
~length~ function, mostly so that we can determine if a list is a
singleton.

#+begin_src lisp
  (claim length
    (Pi ((A U))
      (-> (List A) Nat)))
  (define length
    (lambda (A l)
      (rec-List
        ; target
        l
        ; base
        0
        ; step
        (lambda (_ _ length-tail)
          (add1 length-tail)))))
#+end_src

We can use ~rec-List~ to recursively define a membership predicate on
lists.  This predicate says (albeit more verbosely in the Pie version):

+ x ∉ []
+ x ∈ (y ∷ ys) if x = y or x ∈ ys

#+begin_src lisp
  (claim Elem-List
    (Pi ((A U)
         (x A)
         (l (List A)))
      U))
  (define Elem-List
    (lambda (A x l)
      ((rec-List
         ; target
         l
         ; base
         (the (-> A U) (lambda (_) Absurd))
         ; step
         (lambda (x xs elem-xs)
           (lambda (y)
             (Either
               (= A x y)
               (elem-xs y)))))
       x)))
#+end_src

Now, the kicker: we can prove a natural looking lemma which says that
any 2 elements of a singleton list are the same.  The proof is hairy,
so I won't go into the details, but it goes as you would expect:

#+begin_quote
if x ∈ [a] and y ∈ [a] then x = a and y = a, so x = y.
#+end_quote


#+begin_src lisp
  (claim singleton-has-unique-element-List
    (Pi ((A U)
         (x A)
         (y A)
         (l (List A)))
      (-> (= Nat (length A l) 1)
          (Elem-List A x l)
          (Elem-List A y l)
        (= A x y))))
  (define singleton-has-unique-element-List
    (lambda (A x y l)
      (ind-List
        ; target
        l
        ; motive
        (lambda (l)
          (-> (= Nat (length A l) 1)
              (Elem-List A x l)
              (Elem-List A y l)
            (= A x y)))
        ; base
        (lambda (0=1)
          (explode-1=0
            (-> Absurd
                Absurd
              (= A x y))
            (symm 0=1)))
        ; step
        (lambda (a as almost)
          (ind-List
            ; target
            as
            ; motive
            (lambda (l)
              (-> (= Nat (length A (:: a l)) 1)
                    (Elem-List A x (:: a l))
                    (Elem-List A y (:: a l))
                    (= A x y)))
            ; base
            (lambda (_ x-in-a y-in-a)
              (ind-Either
                ; target
                x-in-a
                ; motive
                (lambda (_) (= A x y))
                ; on-left
                (lambda (a=x)
                  (ind-Either
                    ; target
                    y-in-a
                    ; motive
                    (lambda (_) (= A x y))
                    ; on-left
                    (lambda (a=y)
                      (trans
                        (symm a=x)
                        a=y))
                    ; on-right
                    (lambda (false)
                      (ind-Absurd
                        ; target
                        false
                        ; motive
                        (= A x y)))))
                (lambda (false)
                  (ind-Absurd
                    ; target
                    false
                    ; motive
                    (= A x y)))))
            ; step
            (lambda (b bs _ SSk=1)
              (explode-1=0
                (-> (Elem-List A x (:: a (:: b bs)))
                    (Elem-List A y (:: a (:: b bs)))
                  (= A x y))
                (cong
                  ; target
                  SSk=1
                  ; fun
                  (the (-> Nat Nat)
                    (lambda (n)
                      (which-Nat
                        ; target
                        n
                        ; base
                        0
                        ; step
                        (lambda (n-1)
                          (which-Nat
                            ; target
                            n-1
                            ; base
                            0
                            ; target

                            (lambda (_) 1))))))))))))))
#+end_src

Those of you keeping score at home may have noticed: we snuck in a
couple uses of ~ind-Absurd~!  According to the somewhat artificial
rules of the game we're playing, this is /necessary/. We can
demonstrate this formally by deriving the principle of explosion from
the above lemma without using ~ind-Absurd~.  This works by applying
our lemma to [1], using our false assumption to prove that 0 ∈ [1],
and then exploding the resulting prove of 1 = 0.

#+begin_src lisp
  (claim singleton-has-unique-element-List-implies-ind-absurd
    (-> (Pi ((A U)
             (x A)
             (y A)
             (l (List A)))
          (-> (= Nat (length A l) 1)
              (Elem-List A x l)
              (Elem-List A y l)
            (= A x y)))
      (Pi ((A U)) (-> Absurd A))))
  (define singleton-has-unique-element-List-implies-ind-absurd
    (lambda (prf A absurd)
      (explode-1=0
        A
        (prf
          Nat
          1
          0
          (:: 1 nil)
          (same 1)
          (left (same 1))
          (right absurd)))))
#+end_src

Okay, fine.[fn::This is where things get a bit finicky.  Technically
we /can/ prove everything in this section without ~ind-Absurd~ but
we'd have to use something explosive like ~(= Nat 1 0)~ in place of
~Absurd~ in ~Elem-List~. But this is cheating. We could make the
nature of this cheating more formal, but I'm satisfied with simply
stipulating that, in this game we're playing, we're not allowed to
replace ~Absurd~ in predicates we define.]  But we do get this nice
papacy proof:

#+begin_src lisp
  (claim 1=0-implies-i-am-the-pope-5
    (-> (= Nat 1 0) (= Atom 'me 'pope)))
  (define 1=0-implies-i-am-the-pope-5
    (lambda (1=0)
      (singleton-has-unique-element-List
        Atom
        'me
        'pope
        me-and-the-pope-List
        (cong
          ; target
          1=0
          ; fun
          (the (-> Nat Nat)
            (lambda (n)
              (add1 n))))
        (left (same 'me))              ; 'me is in the list
        (right (left (same 'pope)))))) ; 'pope is in the list
#+end_src

And look! The "add 1 to both sides" part is there!

