papacy.html
<div id="outline-container-org3f29cf5" class="outline-2">
<h2 id="org3f29cf5">Lists</h2>
<div class="outline-text-2" id="text-org3f29cf5">
<p>
Round 2: we begin by putting me and the pope into a 2-element <i>list</i>:
</p>

<div class="org-src-container">
<pre class="src src-lisp">(claim me-and-the-pope-List (List Atom))
(define me-and-the-pope-List (<span style="color: #483d8b;">::</span> 'me (<span style="color: #483d8b;">::</span> 'pope nil)))
</pre>
</div>

<p>
Lists don't keep track of their own length, so we'll need to define a
<code>length</code> function, mostly so that we can determine if a list is a
singleton.
</p>

<div class="org-src-container">
<pre class="src src-lisp">(claim length
  (Pi ((A U))
    (-&gt; (List A) Nat)))
(define length
  (<span style="color: #a020f0;">lambda</span> (A l)
    (rec-List
      <span style="color: #b22222;">; target
</span>      l
      <span style="color: #b22222;">; base
</span>      0
      <span style="color: #b22222;">; step
</span>      (<span style="color: #a020f0;">lambda</span> (_ _ length-tail)
        (add1 length-tail)))))
</pre>
</div>

<p>
We can use <code>rec-List</code> to recursively define a membership predicate on
lists.  This predicate says (albeit more verbosely in the Pie version):
</p>

<ul class="org-ul">
<li>x ∉ []</li>
<li>x ∈ (y ∷ ys) if x = y or x ∈ ys</li>
</ul>

<div class="org-src-container">
<pre class="src src-lisp">(claim Elem-List
  (Pi ((A U)
       (x A)
       (l (List A)))
    U))
(define Elem-List
  (<span style="color: #a020f0;">lambda</span> (A x l)
    ((rec-List
       <span style="color: #b22222;">; target
</span>       l
       <span style="color: #b22222;">; base
</span>       (<span style="color: #a020f0;">the</span> (-&gt; A U) (<span style="color: #a020f0;">lambda</span> (_) Absurd))
       <span style="color: #b22222;">; step
</span>       (<span style="color: #a020f0;">lambda</span> (x xs elem-xs)
         (<span style="color: #a020f0;">lambda</span> (y)
           (Either
             (= A x y)
             (elem-xs y)))))
     x)))
</pre>
</div>

<p>
Now, the kicker: we can prove a natural looking lemma which says that
any 2 elements of a singleton list are the same.  The proof is hairy,
so I won't go into the details, but it goes as you would expect:
</p>

<blockquote>
<p>
if x ∈ [a] and y ∈ [a] then x = a and y = a, so x = y.
</p>
</blockquote>


<div class="org-src-container">
<pre class="src src-lisp">(claim singleton-has-unique-element-List
  (Pi ((A U)
       (x A)
       (y A)
       (l (List A)))
    (-&gt; (= Nat (length A l) 1)
        (Elem-List A x l)
        (Elem-List A y l)
      (= A x y))))
(define singleton-has-unique-element-List
  (<span style="color: #a020f0;">lambda</span> (A x y l)
    (ind-List
      <span style="color: #b22222;">; target
</span>      l
      <span style="color: #b22222;">; motive
</span>      (<span style="color: #a020f0;">lambda</span> (l)
        (-&gt; (= Nat (length A l) 1)
            (Elem-List A x l)
            (Elem-List A y l)
          (= A x y)))
      <span style="color: #b22222;">; base
</span>      (<span style="color: #a020f0;">lambda</span> (0=1)
        (explode-1=0
          (-&gt; Absurd
              Absurd
            (= A x y))
          (symm 0=1)))
      <span style="color: #b22222;">; step
</span>      (<span style="color: #a020f0;">lambda</span> (a as almost)
        (ind-List
          <span style="color: #b22222;">; target
</span>          as
          <span style="color: #b22222;">; motive
</span>          (<span style="color: #a020f0;">lambda</span> (l)
            (-&gt; (= Nat (length A (<span style="color: #483d8b;">::</span> a l)) 1)
                  (Elem-List A x (<span style="color: #483d8b;">::</span> a l))
                  (Elem-List A y (<span style="color: #483d8b;">::</span> a l))
                  (= A x y)))
          <span style="color: #b22222;">; base
</span>          (<span style="color: #a020f0;">lambda</span> (_ x-in-a y-in-a)
            (ind-Either
              <span style="color: #b22222;">; target
</span>              x-in-a
              <span style="color: #b22222;">; motive
</span>              (<span style="color: #a020f0;">lambda</span> (_) (= A x y))
              <span style="color: #b22222;">; on-left
</span>              (<span style="color: #a020f0;">lambda</span> (a=x)
                (ind-Either
                  <span style="color: #b22222;">; target
</span>                  y-in-a
                  <span style="color: #b22222;">; motive
</span>                  (<span style="color: #a020f0;">lambda</span> (_) (= A x y))
                  <span style="color: #b22222;">; on-left
</span>                  (<span style="color: #a020f0;">lambda</span> (a=y)
                    (trans
                      (symm a=x)
                      a=y))
                  <span style="color: #b22222;">; on-right
</span>                  (<span style="color: #a020f0;">lambda</span> (false)
                    (ind-Absurd
                      <span style="color: #b22222;">; target
</span>                      false
                      <span style="color: #b22222;">; motive
</span>                      (= A x y)))))
              (<span style="color: #a020f0;">lambda</span> (false)
                (ind-Absurd
                  <span style="color: #b22222;">; target
</span>                  false
                  <span style="color: #b22222;">; motive
</span>                  (= A x y)))))
          <span style="color: #b22222;">; step
</span>          (<span style="color: #a020f0;">lambda</span> (b bs _ SSk=1)
            (explode-1=0
              (-&gt; (Elem-List A x (<span style="color: #483d8b;">::</span> a (<span style="color: #483d8b;">::</span> b bs)))
                  (Elem-List A y (<span style="color: #483d8b;">::</span> a (<span style="color: #483d8b;">::</span> b bs)))
                (= A x y))
              (cong
                <span style="color: #b22222;">; target
</span>                SSk=1
                <span style="color: #b22222;">; fun
</span>                (<span style="color: #a020f0;">the</span> (-&gt; Nat Nat)
                  (<span style="color: #a020f0;">lambda</span> (n)
                    (which-Nat
                      <span style="color: #b22222;">; target
</span>                      n
                      <span style="color: #b22222;">; base
</span>                      0
                      <span style="color: #b22222;">; step
</span>                      (<span style="color: #a020f0;">lambda</span> (n-1)
                        (which-Nat
                          <span style="color: #b22222;">; target
</span>                          n-1
                          <span style="color: #b22222;">; base
</span>                          0
                          <span style="color: #b22222;">; target
</span>
                          (<span style="color: #a020f0;">lambda</span> (_) 1))))))))))))))
</pre>
</div>

<p>
Those of you keeping score at home may have noticed: we snuck in a
couple uses of <code>ind-Absurd</code>!  According to the somewhat artificial
rules of the game we're playing, this is <i>necessary</i>. We can
demonstrate this formally by deriving the principle of explosion from
the above lemma without using <code>ind-Absurd</code>.  This works by applying
our lemma to [1], using our false assumption to prove that 0 ∈ [1],
and then exploding the resulting prove of 1 = 0.
</p>

<div class="org-src-container">
<pre class="src src-lisp">(claim singleton-has-unique-element-List-implies-ind-absurd
  (-&gt; (Pi ((A U)
           (x A)
           (y A)
           (l (List A)))
        (-&gt; (= Nat (length A l) 1)
            (Elem-List A x l)
            (Elem-List A y l)
          (= A x y)))
    (Pi ((A U)) (-&gt; Absurd A))))
(define singleton-has-unique-element-List-implies-ind-absurd
  (<span style="color: #a020f0;">lambda</span> (prf A absurd)
    (explode-1=0
      A
      (prf
        Nat
        1
        0
        (<span style="color: #483d8b;">::</span> 1 nil)
        (same 1)
        (left (same 1))
        (right absurd)))))
</pre>
</div>

<p>
Okay, fine.<sup><a id="fnr.12" class="footref" href="#fn.12" role="doc-backlink">12</a></sup>  But we do get this nice
papacy proof:
</p>

<div class="org-src-container">
<pre class="src src-lisp">(claim 1=0-implies-i-am-the-pope-5
  (-&gt; (= Nat 1 0) (= Atom 'me 'pope)))
(define 1=0-implies-i-am-the-pope-5
  (<span style="color: #a020f0;">lambda</span> (1=0)
    (singleton-has-unique-element-List
      Atom
      'me
      'pope
      me-and-the-pope-List
      (cong
        <span style="color: #b22222;">; target
</span>        1=0
        <span style="color: #b22222;">; fun
</span>        (<span style="color: #a020f0;">the</span> (-&gt; Nat Nat)
          (<span style="color: #a020f0;">lambda</span> (n)
            (add1 n))))
      (left (same 'me))              <span style="color: #b22222;">; 'me is in the list
</span>      (right (left (same 'pope)))))) <span style="color: #b22222;">; 'pope is in the list</span>
</pre>
</div>

<p>
And look! The "add 1 to both sides" part is there!
</p>
</div>
</div>
